import './App.css';
import {BrowserRouter as Router, Route, Switch} from 'react-router-dom';
import { useState } from 'react';
import Recipedetails from './components/Recipedetails';
import Recipeeapp from './components/Recipeeapp';
import Navbar from './components/Navbar';

function App() {
  const [recipe, setrecipe] = useState([
    {
      id: 1,
      name: " 🌠★  🎀  𝓂𝓎𝓈🍩𝓇𝑒𝓅𝒶𝒸𝓀  🎀  ★🌠𝖐",
      recipe: "𝕾𝖙𝖊𝖕 1 𝕽𝖔𝖆𝖘𝖙 𝖙𝖍𝖊 𝖌𝖗𝖆𝖒 𝖋𝖑𝖔 𝖘𝖙𝖊𝖕 2 𝖕𝖗𝖊𝖕𝖆𝖗𝖊 𝖘𝖚𝖌𝖆𝖗 𝖘𝖞𝖗𝖚𝖕 𝖘𝖙𝖊𝖕 3 𝕾𝖕𝖗𝖊𝖆𝖉 𝖙𝖍𝖊 𝖌𝖗𝖆𝖒 𝖋𝖑𝖔𝖚𝖗 𝖇𝖆𝖙𝖙𝖊𝖗 𝖆𝖓𝖉 𝖈𝖔𝖔𝖑 𝖋𝖔𝖗 𝖘𝖍𝖆𝖕𝖎𝖓𝖌 𝖎𝖙 𝕾𝖙𝖎𝖗 𝖆𝖓𝖉 𝖕𝖔𝖚𝖗 𝖎𝖓𝖙𝖔 𝖆 𝖌𝖗𝖊𝖆𝖘𝖊𝖉 𝖕𝖑𝖆𝖙𝖊. 𝕲𝖊𝖓𝖙𝖑𝖞 𝖘𝖕𝖗𝖊𝖆𝖉 𝖙𝖍𝖊 𝖒𝖎𝖝𝖙𝖚𝖗𝖊 𝖆𝖓𝖉 𝖆𝖑𝖑𝖔𝖜 𝖎𝖙 𝖙𝖔 𝖈𝖔𝖔𝖑 𝖘𝖙𝖊𝖕 4 𝕭𝖊𝖋𝖔𝖗𝖊 𝖎𝖙 𝖍𝖆𝖗𝖉𝖊𝖓𝖘 𝖋𝖚𝖑𝖑𝖞, 𝖘𝖑𝖎𝖈𝖊 𝖎𝖓𝖙𝖔 𝖉𝖊𝖘𝖎𝖗𝖊𝖉 𝖘𝖍𝖆𝖕𝖊𝖘. 𝕾𝖙𝖔𝖗𝖊 𝖎𝖓 𝖆𝖓 𝖆𝖎𝖗𝖙𝖎𝖌𝖍𝖙 𝖈𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗 𝖆𝖓𝖉 𝖘𝖊𝖗𝖛𝖊 𝖆𝖘 𝖞𝖔𝖚 𝖑𝖎𝖐𝖊.𝖘𝖙𝖊𝖕 5 𝕿𝖍𝖎𝖘 𝖘𝖈𝖗𝖚𝖒𝖕𝖙𝖎𝖔𝖚𝖘 𝖉𝖊𝖘𝖘𝖊𝖗𝖙 𝖗𝖊𝖈𝖎𝖕𝖊 𝖎𝖘 𝖘𝖚𝖗𝖊 𝖙𝖔 𝖇𝖊 𝖑𝖔𝖛𝖊𝖉 𝖇𝖞 𝖕𝖊𝖔𝖕𝖑𝖊 𝖔𝖋 𝖆𝖑𝖑 𝖆𝖌𝖊𝖘.​ 𝕿𝖗𝖞 𝖙𝖍𝖎𝖘 𝖊𝖆𝖘𝖞 𝖉𝖊𝖘𝖘𝖊𝖗𝖙 𝖗𝖊𝖈𝖎𝖕𝖊 𝖆𝖓𝖉 𝖌𝖎𝖛𝖊 𝖞𝖔𝖚𝖗 𝖒𝖊𝖆𝖑 𝖆 𝖕𝖊𝖗𝖋𝖊𝖈𝖙 𝖊𝖓𝖉𝖎𝖓𝖌!",
      img: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSGNaW9G_Al1LIS52KT7ebIQyi7m36pWDNTHpxm6rO5pMuYxdJvf-KwDQrK9ENUgGhPrwY&usqp=CAU"
  },
    {
      id: 2,
      name: "☺🍔  𝔾ยⓁÃв 𝓳α𝕞σⓞŇ  🐲🎅",
      recipe: "ℌ𝔬𝔴 𝔗𝔬 𝔐𝔞𝔨𝔢 𝔊𝔲𝔩𝔞𝔟 𝔍𝔞𝔪𝔲𝔫 𝔚𝔦𝔱𝔥𝔬𝔲𝔱 𝔎𝔥𝔬𝔶𝔞 𝔄𝔱 ℌ𝔬𝔪𝔢 𝔇𝔲𝔯𝔦𝔫𝔤 𝔏𝔬𝔠𝔨𝔡𝔬𝔴𝔫 ℌ𝔢𝔯𝔢𝔰 𝔗𝔥𝔢 𝔖𝔱𝔢𝔭-𝔅𝔶-𝔖𝔱𝔢𝔭 ℜ𝔢𝔠𝔦𝔭𝔢 𝔒𝔣 𝔊𝔲𝔩𝔞𝔟 𝔍𝔞𝔪𝔲𝔫 𝔚𝔦𝔱𝔥𝔬𝔲𝔱 𝔎𝔥𝔬𝔶𝔞:𝔖𝔢𝔯𝔳𝔦𝔫𝔤𝔰 - 5-6 𝔤𝔲𝔩𝔞𝔟 𝔧𝔞𝔪𝔲𝔫𝔰 ℑ𝔫𝔤𝔯𝔢𝔡𝔦𝔢𝔫𝔱𝔰 - 2 𝔱𝔟𝔰𝔭 𝔪𝔦𝔩𝔨 3 𝔱𝔟𝔰𝔭 𝔪𝔦𝔩𝔨 𝔭𝔬𝔴𝔡𝔢𝔯 ℌ𝔞𝔩𝔣 𝔠𝔲𝔭 𝔰𝔲𝔤𝔞𝔯 ℌ𝔞𝔩𝔣 𝔱𝔟𝔰𝔭. 𝔪𝔞𝔦𝔡𝔞 ℌ𝔞𝔩𝔣 𝔱𝔢𝔞𝔰𝔭𝔬𝔬𝔫 𝔠𝔞𝔯𝔡𝔞𝔪𝔬𝔪 𝔭𝔬𝔴𝔡𝔢𝔯 1 𝔠𝔲𝔭 𝔴𝔞𝔱𝔢𝔯 𝔄 𝔭𝔦𝔫𝔠𝔥 𝔬𝔣 𝔟𝔞𝔨𝔦𝔫𝔤 𝔰𝔬𝔡𝔞 ℌ𝔞𝔩𝔣 𝔱𝔟𝔰𝔭. 𝔤𝔥𝔢𝔢 𝔐𝔢𝔱𝔥𝔬𝔡 - 𝔖𝔱𝔢𝔭 1- 𝔐𝔞𝔨𝔢 𝔰𝔲𝔤𝔞𝔯 𝔰𝔶𝔯𝔲𝔭 𝔟𝔶 𝔟𝔬𝔦𝔩𝔦𝔫𝔤 𝔰𝔲𝔤𝔞𝔯 𝔞𝔫𝔡 𝔠𝔞𝔯𝔡𝔞𝔪𝔬𝔪 𝔭𝔬𝔴𝔡𝔢𝔯 𝔦𝔫 1 𝔠𝔲𝔭 𝔴𝔞𝔱𝔢𝔯. 𝔄𝔡𝔡 𝔪𝔬𝔯𝔢 𝔴𝔞𝔱𝔢𝔯, 𝔦𝔣 𝔯𝔢𝔮𝔲𝔦𝔯𝔢𝔡. 𝔅𝔬𝔦𝔩 𝔬𝔫 𝔪𝔢𝔡𝔦𝔲𝔪 𝔣𝔩𝔞𝔪𝔢 𝔱𝔦𝔩𝔩 𝔦𝔱 𝔞𝔱𝔱𝔞𝔦𝔫𝔰 𝔞 𝔱𝔥𝔦𝔠𝔨 𝔰𝔶𝔯𝔲𝔭𝔶 𝔱𝔢𝔵𝔱𝔲𝔯𝔢. 𝔖𝔱𝔢𝔭 2 - ℭ𝔬𝔪𝔟𝔦𝔫𝔢 𝔪𝔞𝔦𝔡𝔞, 𝔟𝔞𝔨𝔦𝔫𝔤 𝔰𝔬𝔡𝔞 𝔞𝔫𝔡 𝔪𝔦𝔩𝔨 𝔭𝔬𝔴𝔡𝔢𝔯 𝔦𝔫 𝔞 𝔟𝔬𝔴𝔩. 𝔐𝔦𝔵 𝔴𝔢𝔩𝔩. 𝔖𝔱𝔢𝔭 3 - 𝔄𝔡𝔡 𝔥𝔞𝔩𝔣 𝔱𝔟𝔰𝔭. 𝔤𝔥𝔢𝔢 𝔞𝔫𝔡 𝔪𝔦𝔵. 𝔖𝔱𝔢𝔭 4 - 𝔑𝔬𝔴 𝔞𝔡𝔡 𝔪𝔦𝔩𝔨 𝔞𝔫𝔡 𝔪𝔦𝔵 𝔞𝔤𝔞𝔦𝔫.𝔖𝔱𝔢𝔭 5 - 𝔎𝔫𝔢𝔞𝔡 𝔞 𝔩𝔦𝔤𝔥𝔱 𝔡𝔬𝔲𝔤𝔥 𝔬𝔣 𝔱𝔥𝔢 𝔪𝔦𝔵𝔱𝔲𝔯𝔢.𝔄𝔡𝔡 𝔪𝔬𝔯𝔢 𝔪𝔦𝔩𝔨 𝔦𝔣 𝔯𝔢𝔮𝔲𝔦𝔯𝔢𝔡.𝔐𝔞𝔨𝔢 𝔰𝔲𝔯𝔢 𝔱𝔥𝔢 𝔡𝔬𝔲𝔤𝔥 𝔦𝔰 𝔩𝔦𝔤𝔥𝔱 𝔞𝔫𝔡 𝔰𝔬𝔣𝔱.𝔖𝔱𝔢𝔭 6 - 𝔊𝔯𝔢𝔞𝔰𝔢 𝔶𝔬𝔲𝔯 𝔭𝔞𝔩𝔪𝔰 𝔴𝔦𝔱𝔥 𝔬𝔦𝔩 𝔞𝔫𝔡 𝔡𝔦𝔳𝔦𝔡𝔢 𝔱𝔥𝔢 𝔡𝔬𝔲𝔤𝔥 𝔦𝔫𝔱𝔬 𝔰𝔪𝔞𝔩𝔩 𝔟𝔞𝔩𝔩𝔰.𝔖𝔱𝔢𝔭 7 - 𝔇𝔢𝔢𝔭 𝔣𝔯𝔶 𝔱𝔥𝔢 𝔤𝔲𝔩𝔞𝔟 𝔧𝔞𝔪𝔲𝔫𝔰 𝔱𝔦𝔩𝔩 𝔱𝔥𝔢𝔶 𝔱𝔲𝔯𝔫 𝔤𝔬𝔩𝔡𝔢𝔫 𝔟𝔯𝔬𝔴𝔫 𝔞𝔫𝔡 𝔡𝔦𝔭 𝔱𝔥𝔢𝔪 𝔦𝔫 𝔱𝔥𝔢 𝔰𝔲𝔤𝔞𝔯 𝔰𝔶𝔯𝔲𝔭.ℑ𝔣 𝔶𝔬𝔲 𝔨𝔢𝔢𝔭 𝔱𝔥𝔢 𝔤𝔲𝔩𝔞𝔟 𝔧𝔞𝔪𝔲𝔫𝔰 𝔡𝔦𝔭𝔭𝔢𝔡 𝔦𝔫 𝔰𝔲𝔤𝔞𝔯 𝔰𝔶𝔯𝔲𝔭 𝔣𝔬𝔯 𝔞 𝔠𝔬𝔲𝔭𝔩𝔢 𝔬𝔣 𝔥𝔬𝔲𝔯𝔰 𝔟𝔢𝔣𝔬𝔯𝔢 𝔰𝔢𝔯𝔳𝔦𝔫𝔤, 𝔶𝔬𝔲𝔩𝔩 𝔤𝔢𝔱 𝔪𝔬𝔦𝔰𝔱 𝔞𝔫𝔡 𝔰𝔮𝔲𝔦𝔰𝔥𝔶 𝔤𝔲𝔩𝔞𝔟 𝔧𝔞𝔪𝔲𝔫 𝔞𝔰 𝔱𝔥𝔢𝔶 𝔴𝔬𝔲𝔩𝔡 𝔥𝔞𝔳𝔢 𝔞𝔟𝔰𝔬𝔯𝔟𝔢𝔡 𝔱𝔥𝔢 𝔰𝔶𝔯𝔲𝔭 𝔭𝔯𝔬𝔭𝔢𝔯𝔩𝔶.",
      img: "https://yourfoodfantasy.com/wp-content/uploads/2016/12/How-to-Make-Perfect-Gulab-Jamun-Your-Food-Fantasy-1.png"
  },
    
    {
        id: 3,
        name: "☆💣  ⓁΔ𝒹ｄᵘ  ♜🎯",
        recipe: "𝕳𝖊𝖆𝖙 𝖔𝖎𝖑 𝖋𝖔𝖗 𝖉𝖊𝖊𝖕 𝖋𝖗𝖞𝖎𝖓𝖌 𝖎𝖓 𝖆 𝖐𝖆𝖉𝖆𝖎 𝖔𝖗 𝖕𝖆𝖓. 𝕿𝖍𝖊 𝖔𝖎𝖑 𝖍𝖆𝖘 𝖙𝖔 𝖇𝖊 𝖒𝖔𝖉𝖊𝖗𝖆𝖙𝖊𝖑𝖞 𝖍𝖔𝖙. 𝖂𝖍𝖊𝖓 𝖞𝖔𝖚 𝖆𝖉𝖉 𝖔𝖓𝖊 𝖔𝖗 𝖙𝖜𝖔 𝖉𝖗𝖔𝖕𝖘 𝖔𝖋 𝖙𝖍𝖊 𝖌𝖗𝖆𝖒 𝖋𝖑𝖔𝖚𝖗 𝖇𝖆𝖙𝖙𝖊𝖗, 𝖙𝖍𝖊𝖞 𝖘𝖍𝖔𝖚𝖑𝖉 𝖈𝖔𝖒𝖊 𝖚𝖕 𝖇𝖗𝖎𝖘𝖐𝖑𝖞 𝖇𝖚𝖙 𝖘𝖙𝖊𝖆𝖉𝖎𝖑𝖞 𝖔𝖓 𝖙𝖍𝖊 𝖘𝖚𝖗𝖋𝖆𝖈𝖊.𝕴𝖋 𝖙𝖍𝖊𝖞 𝖈𝖔𝖒𝖊 𝖚𝖕 𝖛𝖊𝖗𝖞 𝖖𝖚𝖎𝖈𝖐𝖑𝖞, 𝖙𝖍𝖊𝖓 𝖙𝖍𝖊 𝖔𝖎𝖑 𝖎𝖘 𝖛𝖊𝖗𝖞 𝖍𝖔𝖙. 𝕴𝖋 𝖙𝖍𝖊𝖞 𝖉𝖔𝖓’𝖙 𝖈𝖔𝖒𝖊 𝖚𝖕 𝖔𝖗 𝖙𝖆𝖐𝖊 𝖙𝖎𝖒𝖊, 𝖙𝖍𝖊 𝖔𝖎𝖑 𝖎𝖘 𝖓𝖔𝖙 𝖊𝖓𝖔𝖚𝖌𝖍 𝖍𝖔𝖙.𝕿𝖆𝖐𝖊 𝖆 𝖕𝖊𝖗𝖋𝖔𝖗𝖆𝖙𝖊𝖉 𝖑𝖆𝖉𝖑𝖊/𝖘𝖕𝖔𝖔𝖓. 𝖂𝖎𝖙𝖍 𝖞𝖔𝖚𝖗 𝖍𝖆𝖓𝖉𝖘 𝖕𝖔𝖘𝖎𝖙𝖎𝖔𝖓 𝖙𝖍𝖊 𝖑𝖆𝖉𝖑𝖊 𝖆𝖇𝖔𝖛𝖊 𝖙𝖍𝖊 𝖔𝖎𝖑. 𝖄𝖔𝖚 𝖜𝖎𝖑𝖑 𝖓𝖊𝖊𝖉 𝖔𝖓𝖊 𝖒𝖔𝖗𝖊 𝖑𝖆𝖗𝖌𝖊 𝖑𝖆𝖉𝖑𝖊/𝖏𝖍𝖆𝖗𝖆 𝖙𝖔 𝖗𝖊𝖒𝖔𝖛𝖊 𝖙𝖍𝖊 𝖋𝖗𝖎𝖊𝖉 𝖇𝖔𝖔𝖓𝖉𝖎𝖘.𝕽𝖊𝖒𝖊𝖒𝖇𝖊𝖗 𝖙𝖔 𝖋𝖗𝖞 𝖙𝖍𝖊 𝖇𝖔𝖔𝖓𝖉𝖎 𝖎𝖓 𝖆 𝖒𝖊𝖉𝖎𝖚𝖒-𝖍𝖔𝖙 𝖔𝖎𝖑 𝖔𝖗 𝖆 𝖒𝖔𝖉𝖊𝖗𝖆𝖙𝖊𝖑𝖞 𝖍𝖔𝖙 𝖔𝖎𝖑. 𝕴𝖋 𝖙𝖍𝖊 𝖔𝖎𝖑 𝖎𝖘 𝖜𝖆𝖗𝖒, 𝖙𝖍𝖊 𝖇𝖔𝖔𝖓𝖉𝖎 𝖜𝖎𝖑𝖑 𝖘𝖔𝖆𝖐 𝖒𝖔𝖗𝖊 𝖔𝖎𝖑, 𝖌𝖊𝖙𝖙𝖎𝖓𝖌 𝖑𝖔𝖆𝖉𝖊𝖉 𝖆𝖓𝖉 𝖘𝖔𝖌𝖌𝖞 𝖜𝖎𝖙𝖍 𝖎𝖙.𝕴𝖋 𝖙𝖍𝖊 𝖔𝖎𝖑 𝖎𝖘 𝖛𝖊𝖗𝖞 𝖍𝖔𝖙, 𝖙𝖍𝖊 𝖇𝖆𝖙𝖙𝖊𝖗 𝖜𝖎𝖑𝖑 𝖌𝖊𝖙 𝖒𝖔𝖗𝖊 𝖇𝖗𝖔𝖜𝖓𝖊𝖉 𝖔𝖗 𝖊𝖛𝖊𝖓 𝖇𝖚𝖗𝖓𝖙 𝖇𝖊𝖈𝖔𝖒𝖎𝖓𝖌 𝖛𝖊𝖗𝖞 𝖈𝖗𝖎𝖘𝖕𝖞.",
        img: "https://static.toiimg.com/thumb/55048059.cms?width=1200&height=900"
    },
   
  ]);
  const [ClickedData, setClickedData] = useState([])

  let getData = (userClick)=>{
    setClickedData(userClick)
  }
console.log(ClickedData)

  return (
    
    <Router>
       
      <div className="App">
      <Navbar />


        <div className="row border border-dark" style={{backgroundcolor:"black"}}>
        <br/>
        <div className="col-md-3"  >
        <Recipeeapp data={recipe} getData={getData}/>
        </div><br/>
        <div className="col-md-8">
        <Recipedetails data={ClickedData}/>
        </div>
        </div>
      </div>
    </Router>
    
  );
}

export default App;
